PayPalAPISoapBinding.BillUser.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:BillUserReq>
    <ns1:BillUserRequest>
     <ns3:MerchantPullPaymentDetails>
      <ns3:Amount currencyID="AFA"></ns3:Amount>
      <ns3:MpID></ns3:MpID>
      <ns3:PaymentType>Any</ns3:PaymentType>
      <ns3:Memo></ns3:Memo>
      <ns3:EmailSubject></ns3:EmailSubject>
      <ns3:Tax currencyID="AFA"></ns3:Tax>
      <ns3:Shipping currencyID="AFA"></ns3:Shipping>
      <ns3:Handling currencyID="AFA"></ns3:Handling>
      <ns3:ItemName></ns3:ItemName>
      <ns3:ItemNumber></ns3:ItemNumber>
      <ns3:Invoice></ns3:Invoice>
      <ns3:Custom></ns3:Custom>
      <ns3:ButtonSource></ns3:ButtonSource>
      <ns3:SoftDescriptor></ns3:SoftDescriptor>
     </ns3:MerchantPullPaymentDetails>
     <ns1:ReturnFMFDetails>0</ns1:ReturnFMFDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:BillUserRequest>
   </ns1:BillUserReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
