PayPalAPISoapBinding.TransactionSearch.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:TransactionSearchReq>
    <ns1:TransactionSearchRequest>
     <ns1:StartDate>2017-10-31T23:05:27Z</ns1:StartDate>
     <ns1:EndDate>2017-10-31T23:05:27Z</ns1:EndDate>
     <ns1:Payer></ns1:Payer>
     <ns1:Receiver></ns1:Receiver>
     <ns1:ReceiptID></ns1:ReceiptID>
     <ns1:TransactionID></ns1:TransactionID>
     <ns1:ProfileID></ns1:ProfileID>
     <ns1:PayerName>
      <ns3:Salutation></ns3:Salutation>
      <ns3:FirstName></ns3:FirstName>
      <ns3:MiddleName></ns3:MiddleName>
      <ns3:LastName></ns3:LastName>
      <ns3:Suffix></ns3:Suffix>
     </ns1:PayerName>
     <ns1:AuctionItemNumber></ns1:AuctionItemNumber>
     <ns1:InvoiceID></ns1:InvoiceID>
     <ns1:CardNumber></ns1:CardNumber>
     <ns1:TransactionClass>All</ns1:TransactionClass>
     <ns1:Amount currencyID="AFA"></ns1:Amount>
     <ns1:CurrencyCode>AFA</ns1:CurrencyCode>
     <ns1:Status>Pending</ns1:Status>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:TransactionSearchRequest>
   </ns1:TransactionSearchReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
