catalog/includes/paypal_wpp/xml/refundTransaction.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <RequesterCredentials xmlns="urn:ebay:api:PayPalAPI">
      <Credentials xmlns="urn:ebay:apis:eBLBaseComponents">
        <Username>PAYPAL_USERNAME</Username>
        <Password>PAYPAL_PASSWORD</Password>
        <Subject></Subject>
      </Credentials>
    </RequesterCredentials>
  </soap:Header>
  <soap:Body>
    <RefundTransactionReq xmlns="urn:ebay:api:PayPalAPI">
      <RefundTransactionRequest xsi:type="ns:RefundTransactionRequestType">
        <Version xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="xsd:string">PAYPAL_VERSION</Version>
        <TransactionID xsi:type="ebl:TransactionId">PAYPAL_TRANSACTION_ID</TransactionID>
        <RefundType>PAYPAL_REFUND_TYPE</RefundType>
        PAYPAL_AMOUNT
      </RefundTransactionRequest>
    </RefundTransactionReq>
  </soap:Body>
</soap:Envelope>